Tekla Open API Reference for Tekla Structures 2025
CatalogHandler.GetDrawingItems Method
 Returns an enumerator of all drawing items.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingItemEnumerator GetDrawingItems()
Public Function GetDrawingItems As DrawingItemEnumerator
Return Value
Type: DrawingItemEnumerator
A DrawingItemEnumerator of all drawing catalog items.
See Also
Reference
CatalogHandler Class
Tekla.Structures.Catalogs Namespace